package quiz;

public class QuRockPaperScissors {

	public static void main(String[] args) {
		/*
		 * 게임설명 : 가위바위보 게임을 메소드를 통해 구현한다.
		 * 난수생성기를 이용하여 1, 2, 3중 하나의 숫자를 생성한다. 정수%3 => 0, 1, 2 나온다. + 1 해주면 1, 2, 3 => 배열E01 02참조
		 * 사용자가 가위(1),바위(2),보(3) 중 하나를 낸다. 비교연산자를 사용하지 말고 if문 9개, 
		 * 승부를 판단하여 출력한다. 
		 * 1,2,3 이외의 숫자를 입력하면 잘못된 입력을 알려주고 재입력을 요구한다. 
		 * 숫자입력을 잘못한 경우는 게임횟수에 포함하지 않는다. 
		 * 게임은 5번 진행하고 5번째 게임을 끝내면 다시할지 물어본다.
		 * 재시작(1), 종료(0) 0, 1 이외의 숫자를 입력하면 재입력을 요구해야 한다.
		 */
		
	}

}
